blog/2021/how-to-learn-new-field-by-yourself.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 14:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>如何自学一个领域</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">如何自学一个领域</h1>
</header><p>
<a href="https://mp.weixin.qq.com/s/aCUIdDfgisasmE6kIBv5gw">https://mp.weixin.qq.com/s/aCUIdDfgisasmE6kIBv5gw</a>
</p>

<p>
第一步：搭框架
</p>

<p>
让自己初步了解领域内容。
</p>

<p>
方法：
</p>

<ol class="org-ol">
<li>搜寻该领域 3-5 本经典教材</li>
<li>浏览一遍</li>
</ol>

<p>
在浏览过程中，思考和回答以下三个问题：
</p>

<ul class="org-ul">
<li>What：这个领域研究的对象是什么？有哪些主要流派和分支？有哪些常用术语？</li>
<li>Why：这个领域存在的意义是什么？为了解决什么问题？现在进展到哪里？</li>
<li>How：这个领域的主要方法是什么？有哪些被广泛承认和应用的基本成果？</li>
</ul>

<p>
第二步：理解概念。
</p>

<p>
遇到一个概念的过程中，可能会遇到的新的概念，依次循环往复下去；什么时候要停止呢？如果你能用自己的话，解释这个概念，就可以停止搜索了。
</p>

<p>
比如：循着「质料」，你可能会看到「质料-形式」，跳到「四因说」……到这里就可以了。再继续深入，就已经跟「质料」没有太大关系了。
</p>

<p>
第三步：形成网络
</p>

<p>
始终联系其他事物，时时刻刻思考：我学到了一个什么知识点？它可以跟别的什么知识点联系起来？如何构建这种联系？
</p>

<p>
学习的核心在于*知识的本质不由信息本身决定，而是信息之间的联系*。
</p>

<p>
第四步：主题思考
</p>

<p>
围绕某一个主题内容，汇集遇到的各种信息。
</p>

<p>
前四步都是在积累知识。
</p>

<p>
第五步：知识的应用——迁移。
</p>

<p>
重要例子：
</p>

<blockquote>
<p>
假如你在学习编程，那么，最重要的一步是什么？就是对你想实现的效果去「拆解」，把它们用计算机能够理解的流程、模式，描述出来，再对应到自己积累的编程知识，去「调用」已有的知识来解决问题。
</p>
</blockquote>

<p>
迁移方法：
</p>

<ol class="org-ol">
<li>类比</li>
<li>黑箱</li>
<li>抽象</li>
</ol>

<p>
第六步：建立模型（方法论）
</p>

<p>
第七步：更新旧节点、知识间的联系</p>
</div>
</body>
</html>